Creates a compound structure layer using default settings.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public CompoundStructureLayer()
  Visual Basic
Public Sub New
  Visual C++
public:
CompoundStructureLayer()
 Remarks
 Note that the combination of the default values does not create a completely valid CompoundStructureLayer. You should change the necessary values before adding to a CompoundStructure.
 See Also
  CompoundStructureLayer Class
  CompoundStructureLayer Overload
  Autodesk.Revit.DB Namespace